---
kind: type
id: T:Autodesk.Revit.DB.ConnectionWarning
source: html/20d055a6-e3e4-fa65-03b4-5ea4dbf93019.htm
---
# Autodesk.Revit.DB.ConnectionWarning

An enumerated type listing all the reasons for connectivity failure.

## Syntax (C#)
```csharp
public enum ConnectionWarning
```